espressif/esp-idf/components/soc/esp32h2/include/soc/clkrst_reg.h
// Copyright 2017-2018 Espressif Systems (Shanghai) PTE LTD
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at
//
//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.
#ifndef _SOC_CLKRST_REG_H_
#define _SOC_CLKRST_REG_H_


#ifdef __cplusplus
extern "C" {
#endif
#include "soc.h"
#define SYSTEM_SYSCLK_CONF_REG          (DR_REG_CLKRST_BASE + 0x0000)
/* SYSTEM_SOC_CLK_SEL : R/W ;bitpos:[17:16] ;default: 2'h3 ; */
/*description: */
#define SYSTEM_SOC_CLK_SEL  0x00000003
#define SYSTEM_SOC_CLK_SEL_M  ((SYSTEM_SOC_CLK_SEL_V)<<(SYSTEM_SOC_CLK_SEL_S))
#define SYSTEM_SOC_CLK_SEL_V  0x3
#define SYSTEM_SOC_CLK_SEL_S  16
/* SYSTEM_SPLL_FREQ : RO ;bitpos:[15:8] ;default: 8'h0 ; */
/*description: */
#define SYSTEM_SPLL_FREQ  0x000000FF
#define SYSTEM_SPLL_FREQ_M  ((SYSTEM_SPLL_FREQ_V)<<(SYSTEM_SPLL_FREQ_S))
#define SYSTEM_SPLL_FREQ_V  0xFF
#define SYSTEM_SPLL_FREQ_S  8
/* SYSTEM_XTAL_FREQ : RO ;bitpos:[7:0] ;default: 8'h0 ; */
/*description: */
#define SYSTEM_CLK_XTAL_FREQ  0x000000FF
#define SYSTEM_CLK_XTAL_FREQ_M  ((SYSTEM_XTAL_FREQ_V)<<(SYSTEM_XTAL_FREQ_S))
#define SYSTEM_CLK_XTAL_FREQ_V  0xFF
#define SYSTEM_CLK_XTAL_FREQ_S  0

#define SYSTEM_CPUCLK_CONF_REG          (DR_REG_CLKRST_BASE + 0x0004)
/* SYSTEM_CPU_DIV_DENOMINATOR : R/W ;bitpos:[21:16] ;default: 6'h0 ; */
/*description: */
#define SYSTEM_CPU_DIV_DENOMINATOR  0x0000003F
#define SYSTEM_CPU_DIV_DENOMINATOR_M  ((SYSTEM_CPU_DIV_DENOMINATOR_V)<<(SYSTEM_CPU_DIV_DENOMINATOR_S))
#define SYSTEM_CPU_DIV_DENOMINATOR_V  0x3F
#define SYSTEM_CPU_DIV_DENOMINATOR_S  16
/* SYSTEM_CPU_DIV_NUMERATOR : R/W ;bitpos:[13:8] ;default: 6'h0 ; */
/*description: */
#define SYSTEM_CPU_DIV_NUMERATOR  0x0000003F
#define SYSTEM_CPU_DIV_NUMERATOR_M  ((SYSTEM_CPU_DIV_NUMERATOR_V)<<(SYSTEM_CPU_DIV_NUMERATOR_S))
#define SYSTEM_CPU_DIV_NUMERATOR_V  0x3F
#define SYSTEM_CPU_DIV_NUMERATOR_S  8
/* SYSTEM_CPU_DIV_NUM : R/W ;bitpos:[7:0] ;default: 8'h0 ; */
/*description: */
#define SYSTEM_CPU_DIV_NUM  0x000000FF
#define SYSTEM_CPU_DIV_NUM_M  ((SYSTEM_CPU_DIV_NUM_V)<<(SYSTEM_CPU_DIV_NUM_S))
#define SYSTEM_CPU_DIV_NUM_V  0xFF
#define SYSTEM_CPU_DIV_NUM_S  0

#define SYSTEM_PRE_DIV_CNT  SYSTEM_CPU_DIV_NUM
#define SYSTEM_PRE_DIV_CNT_M  SYSTEM_CPU_DIV_NUM_M
#define SYSTEM_PRE_DIV_CNT_V  SYSTEM_CPU_DIV_NUM_V
#define SYSTEM_PRE_DIV_CNT_S  SYSTEM_CPU_DIV_NUM_S
	
#define SYSTEM_BUSCLK_CONF_REG          (DR_REG_CLKRST_BASE + 0x0008)
/* SYSTEM_AHB_DIV_NUM : R/W ;bitpos:[15:8] ;default: 8'h0 ; */
/*description: */
#define SYSTEM_AHB_DIV_NUM  0x000000FF
#define SYSTEM_AHB_DIV_NUM_M  ((SYSTEM_AHB_DIV_NUM_V)<<(SYSTEM_AHB_DIV_NUM_S))
#define SYSTEM_AHB_DIV_NUM_V  0xFF
#define SYSTEM_AHB_DIV_NUM_S  8
/* SYSTEM_APB_DIV_NUM : R/W ;bitpos:[7:0] ;default: 8'h0 ; */
/*description: */
#define SYSTEM_APB_DIV_NUM  0x000000FF
#define SYSTEM_APB_DIV_NUM_M  ((SYSTEM_APB_DIV_NUM_V)<<(SYSTEM_APB_DIV_NUM_S))
#define SYSTEM_APB_DIV_NUM_V  0xFF
#define SYSTEM_APB_DIV_NUM_S  0

#define SYSTEM_MODCLK_CONF_REG          (DR_REG_CLKRST_BASE + 0x000C)
/* SYSTEM_MODEM_CLK_SEL : R/W ;bitpos:[1:0] ;default: 1'h1 ; */
/*description: */
#define SYSTEM_MODEM_CLK_SEL  0x00000003
#define SYSTEM_MODEM_CLK_SEL_M  ((SYSTEM_MODEM_CLK_SEL_V)<<(SYSTEM_MODEM_CLK_SEL_S))
#define SYSTEM_MODEM_CLK_SEL_V  0x3
#define SYSTEM_MODEM_CLK_SEL_S  0

#define SYSTEM_CLK_OUT_EN_REG          (DR_REG_CLKRST_BASE + 0x0010)
/* SYSTEM_CLK_RFADC_OEN : R/W ;bitpos:[12] ;default: 1'b1 ; */
/*description: */
#define SYSTEM_CLK_RFADC_OEN  (BIT(12))
#define SYSTEM_CLK_RFADC_OEN_M  (BIT(12))
#define SYSTEM_CLK_RFADC_OEN_V  0x1
#define SYSTEM_CLK_RFADC_OEN_S  12
/* SYSTEM_CLK_RFDAC_OEN : R/W ;bitpos:[11] ;default: 1'b1 ; */
/*description: */
#define SYSTEM_CLK_RFDAC_OEN  (BIT(11))
#define SYSTEM_CLK_RFDAC_OEN_M  (BIT(11))
#define SYSTEM_CLK_RFDAC_OEN_V  0x1
#define SYSTEM_CLK_RFDAC_OEN_S  11
/* SYSTEM_CLK_XTAL_OEN : R/W ;bitpos:[10] ;default: 1'b1 ; */
/*description: */
#define SYSTEM_CLK_XTAL_OEN  (BIT(10))
#define SYSTEM_CLK_XTAL_OEN_M  (BIT(10))
#define SYSTEM_CLK_XTAL_OEN_V  0x1
#define SYSTEM_CLK_XTAL_OEN_S  10
/* SYSTEM_CLK_SPLL_OEN : R/W ;bitpos:[9] ;default: 1'b1 ; */
/*description: */
#define SYSTEM_CLK_SPLL_OEN  (BIT(9))
#define SYSTEM_CLK_SPLL_OEN_M  (BIT(9))
#define SYSTEM_CLK_SPLL_OEN_V  0x1
#define SYSTEM_CLK_SPLL_OEN_S  9
/* SYSTEM_CLK_CPU_OEN : R/W ;bitpos:[8] ;default: 1'b1 ; */
/*description: */
#define SYSTEM_CLK_CPU_OEN  (BIT(8))
#define SYSTEM_CLK_CPU_OEN_M  (BIT(8))
#define SYSTEM_CLK_CPU_OEN_V  0x1
#define SYSTEM_CLK_CPU_OEN_S  8
/* SYSTEM_CLK_AHB_OEN : R/W ;bitpos:[7] ;default: 1'b1 ; */
/*description: */
#define SYSTEM_CLK_AHB_OEN  (BIT(7))
#define SYSTEM_CLK_AHB_OEN_M  (BIT(7))
#define SYSTEM_CLK_AHB_OEN_V  0x1
#define SYSTEM_CLK_AHB_OEN_S  7
/* SYSTEM_CLK_APB_OEN : R/W ;bitpos:[6] ;default: 1'b1 ; */
/*description: */
#define SYSTEM_CLK_APB_OEN  (BIT(6))
#define SYSTEM_CLK_APB_OEN_M  (BIT(6))
#define SYSTEM_CLK_APB_OEN_V  0x1
#define SYSTEM_CLK_APB_OEN_S  6
/* SYSTEM_CLK_32M_BT_OEN : R/W ;bitpos:[5] ;default: 1'b1 ; */
/*description: */
#define SYSTEM_CLK_32M_BT_OEN  (BIT(5))
#define SYSTEM_CLK_32M_BT_OEN_M  (BIT(5))
#define SYSTEM_CLK_32M_BT_OEN_V  0x1
#define SYSTEM_CLK_32M_BT_OEN_S  5
/* SYSTEM_CLK_16M_BT_OEN : R/W ;bitpos:[4] ;default: 1'b1 ; */
/*description: */
#define SYSTEM_CLK_16M_BT_OEN  (BIT(4))
#define SYSTEM_CLK_16M_BT_OEN_M  (BIT(4))
#define SYSTEM_CLK_16M_BT_OEN_V  0x1
#define SYSTEM_CLK_16M_BT_OEN_S  4
/* SYSTEM_CLK_8M_BT_OEN : R/W ;bitpos:[3] ;default: 1'b1 ; */
/*description: */
#define SYSTEM_CLK_8M_BT_OEN  (BIT(3))
#define SYSTEM_CLK_8M_BT_OEN_M  (BIT(3))
#define SYSTEM_CLK_8M_BT_OEN_V  0x1
#define SYSTEM_CLK_8M_BT_OEN_S  3

