espressif/esp-idf/components/soc/esp32h2/include/soc/clkrst_reg.h
#define SYSTEM_MODEM_CLK_EN_REG          (DR_REG_CLKRST_BASE + 0x0014)
/* SYSTEM_DATA_DUMP_CLK_EN : R/W ;bitpos:[21] ;default: 1'b0 ; */
/*description: */
#define SYSTEM_DATA_DUMP_CLK_EN  (BIT(21))
#define SYSTEM_DATA_DUMP_CLK_EN_M  (BIT(21))
#define SYSTEM_DATA_DUMP_CLK_EN_V  0x1
#define SYSTEM_DATA_DUMP_CLK_EN_S  21
/* SYSTEM_RFADC_CLK_EN : R/W ;bitpos:[20] ;default: 1'b0 ; */
/*description: */
#define SYSTEM_RFADC_CLK_EN  (BIT(20))
#define SYSTEM_RFADC_CLK_EN_M  (BIT(20))
#define SYSTEM_RFADC_CLK_EN_V  0x1
#define SYSTEM_RFADC_CLK_EN_S  20
/* SYSTEM_RFDAC_CLK_EN : R/W ;bitpos:[19] ;default: 1'b0 ; */
/*description: */
#define SYSTEM_RFDAC_CLK_EN  (BIT(19))
#define SYSTEM_RFDAC_CLK_EN_M  (BIT(19))
#define SYSTEM_RFDAC_CLK_EN_V  0x1
#define SYSTEM_RFDAC_CLK_EN_S  19
/* SYSTEM_BTLC_CLK_EN : R/W ;bitpos:[18] ;default: 1'b0 ; */
/*description: */
#define SYSTEM_BTLC_CLK_EN  (BIT(18))
#define SYSTEM_BTLC_CLK_EN_M  (BIT(18))
#define SYSTEM_BTLC_CLK_EN_V  0x1
#define SYSTEM_BTLC_CLK_EN_S  18
/* SYSTEM_BLE_SEC_CLK_EN : R/W ;bitpos:[17] ;default: 1'b0 ; */
/*description: */
#define SYSTEM_BLE_SEC_CLK_EN  (BIT(17))
#define SYSTEM_BLE_SEC_CLK_EN_M  (BIT(17))
#define SYSTEM_BLE_SEC_CLK_EN_V  0x1
#define SYSTEM_BLE_SEC_CLK_EN_S  17
/* SYSTEM_BLE_SEC_AAR_CLK_EN : R/W ;bitpos:[16] ;default: 1'b0 ; */
/*description: */
#define SYSTEM_BLE_SEC_AAR_CLK_EN  (BIT(16))
#define SYSTEM_BLE_SEC_AAR_CLK_EN_M  (BIT(16))
#define SYSTEM_BLE_SEC_AAR_CLK_EN_V  0x1
#define SYSTEM_BLE_SEC_AAR_CLK_EN_S  16
/* SYSTEM_BLE_SEC_CCM_CLK_EN : R/W ;bitpos:[15] ;default: 1'b0 ; */
/*description: */
#define SYSTEM_BLE_SEC_CCM_CLK_EN  (BIT(15))
#define SYSTEM_BLE_SEC_CCM_CLK_EN_M  (BIT(15))
#define SYSTEM_BLE_SEC_CCM_CLK_EN_V  0x1
#define SYSTEM_BLE_SEC_CCM_CLK_EN_S  15
/* SYSTEM_BLE_SEC_ECB_CLK_EN : R/W ;bitpos:[14] ;default: 1'b0 ; */
/*description: */
#define SYSTEM_BLE_SEC_ECB_CLK_EN  (BIT(14))
#define SYSTEM_BLE_SEC_ECB_CLK_EN_M  (BIT(14))
#define SYSTEM_BLE_SEC_ECB_CLK_EN_V  0x1
#define SYSTEM_BLE_SEC_ECB_CLK_EN_S  14
/* SYSTEM_IEEE802154MAC_CLK_EN : R/W ;bitpos:[13] ;default: 1'b0 ; */
/*description: */
#define SYSTEM_IEEE802154MAC_CLK_EN  (BIT(13))
#define SYSTEM_IEEE802154MAC_CLK_EN_M  (BIT(13))
#define SYSTEM_IEEE802154MAC_CLK_EN_V  0x1
#define SYSTEM_IEEE802154MAC_CLK_EN_S  13
/* SYSTEM_IEEE802154BB_CLK_EN : R/W ;bitpos:[12] ;default: 1'b0 ; */
/*description: */
#define SYSTEM_IEEE802154BB_CLK_EN  (BIT(12))
#define SYSTEM_IEEE802154BB_CLK_EN_M  (BIT(12))
#define SYSTEM_IEEE802154BB_CLK_EN_V  0x1
#define SYSTEM_IEEE802154BB_CLK_EN_S  12
/* SYSTEM_COEX_CLK_EN : R/W ;bitpos:[11] ;default: 1'b0 ; */
/*description: */
#define SYSTEM_COEX_CLK_EN  (BIT(11))
#define SYSTEM_COEX_CLK_EN_M  (BIT(11))
#define SYSTEM_COEX_CLK_EN_V  0x1
#define SYSTEM_COEX_CLK_EN_S  11
/* SYSTEM_I2CMST_CLK_EN : R/W ;bitpos:[10] ;default: 1'b1 ; */
/*description: */
#define SYSTEM_I2CMST_CLK_EN  (BIT(10))
#define SYSTEM_I2CMST_CLK_EN_M  (BIT(10))
#define SYSTEM_I2CMST_CLK_EN_V  0x1
#define SYSTEM_I2CMST_CLK_EN_S  10
/* SYSTEM_I2C_CLK_EN : R/W ;bitpos:[9] ;default: 1'b1 ; */
/*description: */
#define SYSTEM_I2C_CLK_EN  (BIT(9))
#define SYSTEM_I2C_CLK_EN_M  (BIT(9))
#define SYSTEM_I2C_CLK_EN_V  0x1
#define SYSTEM_I2C_CLK_EN_S  9
/* SYSTEM_RW_BTMAC_CLK_EN : R/W ;bitpos:[8] ;default: 2'b0 ; */
/*description: */
#define SYSTEM_RW_BTMAC_CLK_EN  (BIT(8))
#define SYSTEM_RW_BTMAC_CLK_EN_M  (BIT(8))
#define SYSTEM_RW_BTMAC_CLK_EN_V  0x1
#define SYSTEM_RW_BTMAC_CLK_EN_S  8
/* SYSTEM_MACPWR_CLK_EN : R/W ;bitpos:[7] ;default: 1'b1 ; */
/*description: */
#define SYSTEM_MACPWR_CLK_EN  (BIT(7))
#define SYSTEM_MACPWR_CLK_EN_M  (BIT(7))
#define SYSTEM_MACPWR_CLK_EN_V  0x1
#define SYSTEM_MACPWR_CLK_EN_S  7
/* SYSTEM_EMAC_CLK_EN : R/W ;bitpos:[6] ;default: 1'b1 ; */
/*description: */
#define SYSTEM_EMAC_CLK_EN  (BIT(6))
#define SYSTEM_EMAC_CLK_EN_M  (BIT(6))
#define SYSTEM_EMAC_CLK_EN_V  0x1
#define SYSTEM_EMAC_CLK_EN_S  6
/* SYSTEM_SDIO_CLK_EN : R/W ;bitpos:[5] ;default: 1'b1 ; */
/*description: */
#define SYSTEM_SDIO_CLK_EN  (BIT(5))
#define SYSTEM_SDIO_CLK_EN_M  (BIT(5))
#define SYSTEM_SDIO_CLK_EN_V  0x1
#define SYSTEM_SDIO_CLK_EN_S  5
/* SYSTEM_BTMAC_CLK_EN : R/W ;bitpos:[4] ;default: 1'b0 ; */
/*description: */
#define SYSTEM_BTMAC_CLK_EN  (BIT(4))
#define SYSTEM_BTMAC_CLK_EN_M  (BIT(4))
#define SYSTEM_BTMAC_CLK_EN_V  0x1
#define SYSTEM_BTMAC_CLK_EN_S  4
/* SYSTEM_BT_CLK_EN : R/W ;bitpos:[3] ;default: 1'b0 ; */
/*description: */
#define SYSTEM_BT_CLK_EN  (BIT(3))
#define SYSTEM_BT_CLK_EN_M  (BIT(3))
#define SYSTEM_BT_CLK_EN_V  0x1
#define SYSTEM_BT_CLK_EN_S  3
/* SYSTEM_MAC_CLK_EN : R/W ;bitpos:[2] ;default: 1'b0 ; */
/*description: */
#define SYSTEM_MAC_CLK_EN  (BIT(2))
#define SYSTEM_MAC_CLK_EN_M  (BIT(2))
#define SYSTEM_MAC_CLK_EN_V  0x1
#define SYSTEM_MAC_CLK_EN_S  2
/* SYSTEM_FE_CLK_EN : R/W ;bitpos:[1] ;default: 1'b0 ; */
/*description: */
#define SYSTEM_FE_CLK_EN  (BIT(1))
#define SYSTEM_FE_CLK_EN_M  (BIT(1))
#define SYSTEM_FE_CLK_EN_V  0x1
#define SYSTEM_FE_CLK_EN_S  1
/* SYSTEM_FE_CAL_CLK_EN : R/W ;bitpos:[0] ;default: 1'b0 ; */
/*description: */
#define SYSTEM_FE_CAL_CLK_EN  (BIT(0))
#define SYSTEM_FE_CAL_CLK_EN_M  (BIT(0))
#define SYSTEM_FE_CAL_CLK_EN_V  0x1
#define SYSTEM_FE_CAL_CLK_EN_S  0

#define SYSTEM_MODEM_RST_EN_REG          (DR_REG_CLKRST_BASE + 0x0018)
/* SYSTEM_DATA_DUMP_RST : R/W ;bitpos:[20] ;default: 1'b0 ; */
/*description: */
#define SYSTEM_DATA_DUMP_RST  (BIT(20))
#define SYSTEM_DATA_DUMP_RST_M  (BIT(20))
#define SYSTEM_DATA_DUMP_RST_V  0x1
#define SYSTEM_DATA_DUMP_RST_S  20
/* SYSTEM_APB_RET_RST : R/W ;bitpos:[19] ;default: 1'b0 ; */
/*description: */
#define SYSTEM_APB_RET_RST  (BIT(19))
#define SYSTEM_APB_RET_RST_M  (BIT(19))
#define SYSTEM_APB_RET_RST_V  0x1
#define SYSTEM_APB_RET_RST_S  19
/* SYSTEM_BLE_SEC_RST : R/W ;bitpos:[18] ;default: 1'b0 ; */
/*description: */
#define SYSTEM_BLE_SEC_RST  (BIT(18))
#define SYSTEM_BLE_SEC_RST_M  (BIT(18))
#define SYSTEM_BLE_SEC_RST_V  0x1
#define SYSTEM_BLE_SEC_RST_S  18
/* SYSTEM_BLE_SEC_AAR_RST : R/W ;bitpos:[17] ;default: 1'b0 ; */
/*description: */
#define SYSTEM_BLE_SEC_AAR_RST  (BIT(17))
#define SYSTEM_BLE_SEC_AAR_RST_M  (BIT(17))
#define SYSTEM_BLE_SEC_AAR_RST_V  0x1
#define SYSTEM_BLE_SEC_AAR_RST_S  17
/* SYSTEM_BLE_SEC_CCM_RST : R/W ;bitpos:[16] ;default: 1'b0 ; */
/*description: */
#define SYSTEM_BLE_SEC_CCM_RST  (BIT(16))
#define SYSTEM_BLE_SEC_CCM_RST_M  (BIT(16))
#define SYSTEM_BLE_SEC_CCM_RST_V  0x1
#define SYSTEM_BLE_SEC_CCM_RST_S  16
/* SYSTEM_BLE_SEC_ECB_RST : R/W ;bitpos:[15] ;default: 1'b0 ; */
/*description: */
#define SYSTEM_BLE_SEC_ECB_RST  (BIT(15))
#define SYSTEM_BLE_SEC_ECB_RST_M  (BIT(15))
#define SYSTEM_BLE_SEC_ECB_RST_V  0x1
#define SYSTEM_BLE_SEC_ECB_RST_S  15
/* SYSTEM_IEEE802154MAC_RST : R/W ;bitpos:[14] ;default: 1'b0 ; */
/*description: */
#define SYSTEM_IEEE802154MAC_RST  (BIT(14))
#define SYSTEM_IEEE802154MAC_RST_M  (BIT(14))
#define SYSTEM_IEEE802154MAC_RST_V  0x1
#define SYSTEM_IEEE802154MAC_RST_S  14
/* SYSTEM_IEEE802154BB_RST : R/W ;bitpos:[13] ;default: 1'b0 ; */
/*description: */
#define SYSTEM_IEEE802154BB_RST  (BIT(13))
#define SYSTEM_IEEE802154BB_RST_M  (BIT(13))
#define SYSTEM_IEEE802154BB_RST_V  0x1
#define SYSTEM_IEEE802154BB_RST_S  13
/* SYSTEM_COEX_RST : R/W ;bitpos:[12] ;default: 1'b0 ; */
/*description: */
#define SYSTEM_COEX_RST  (BIT(12))
#define SYSTEM_COEX_RST_M  (BIT(12))
#define SYSTEM_COEX_RST_V  0x1
#define SYSTEM_COEX_RST_S  12
/* SYSTEM_BT_RST : R/W ;bitpos:[11] ;default: 1'b0 ; */
/*description: */
#define SYSTEM_BT_REG_RST  (BIT(11))
#define SYSTEM_BT_REG_RST_M  (BIT(11))
#define SYSTEM_BT_REG_RST_V  0x1
#define SYSTEM_BT_REG_RST_S  11
/* SYSTEM_RW_BTLPRST : R/W ;bitpos:[10] ;default: 1'b0 ; */
/*description: */
#define SYSTEM_RW_BTLPRST  (BIT(10))
#define SYSTEM_RW_BTLPRST_M  (BIT(10))
#define SYSTEM_RW_BTLPRST_V  0x1
#define SYSTEM_RW_BTLPRST_S  10
/* SYSTEM_RW_BTRST : R/W ;bitpos:[9] ;default: 1'b0 ; */
/*description: */
#define SYSTEM_RW_BTRST  (BIT(9))
#define SYSTEM_RW_BTRST_M  (BIT(9))
#define SYSTEM_RW_BTRST_V  0x1
#define SYSTEM_RW_BTRST_S  9
/* SYSTEM_RW_BTLP_RST : R/W ;bitpos:[8] ;default: 1'b0 ; */
/*description: */
#define SYSTEM_RW_BTLP_RST  (BIT(8))
#define SYSTEM_RW_BTLP_RST_M  (BIT(8))
#define SYSTEM_RW_BTLP_RST_V  0x1
#define SYSTEM_RW_BTLP_RST_S  8
/* SYSTEM_RW_BTMAC_RST : R/W ;bitpos:[7] ;default: 1'b0 ; */
/*description: */
#define SYSTEM_RW_BTMAC_RST  (BIT(7))
#define SYSTEM_RW_BTMAC_RST_M  (BIT(7))
#define SYSTEM_RW_BTMAC_RST_V  0x1
#define SYSTEM_RW_BTMAC_RST_S  7
/* SYSTEM_MACPWR_RST : R/W ;bitpos:[6] ;default: 1'b0 ; */
/*description: */
#define SYSTEM_MACPWR_RST  (BIT(6))
#define SYSTEM_MACPWR_RST_M  (BIT(6))
#define SYSTEM_MACPWR_RST_V  0x1
#define SYSTEM_MACPWR_RST_S  6
/* SYSTEM_EMAC_RST : R/W ;bitpos:[5] ;default: 1'b0 ; */
/*description: */
#define SYSTEM_EMAC_RST  (BIT(5))
#define SYSTEM_EMAC_RST_M  (BIT(5))
#define SYSTEM_EMAC_RST_V  0x1
#define SYSTEM_EMAC_RST_S  5
/* SYSTEM_SDIO_RST : R/W ;bitpos:[4] ;default: 1'b0 ; */
/*description: */
#define SYSTEM_SDIO_RST  (BIT(4))
#define SYSTEM_SDIO_RST_M  (BIT(4))
#define SYSTEM_SDIO_RST_V  0x1
#define SYSTEM_SDIO_RST_S  4
/* SYSTEM_BTMAC_RST : R/W ;bitpos:[3] ;default: 1'b0 ; */
/*description: */
#define SYSTEM_BTMAC_RST  (BIT(3))
#define SYSTEM_BTMAC_RST_M  (BIT(3))
#define SYSTEM_BTMAC_RST_V  0x1
#define SYSTEM_BTMAC_RST_S  3
/* SYSTEM_BT_RST : R/W ;bitpos:[2] ;default: 1'b0 ; */
/*description: */
#define SYSTEM_BT_RST  (BIT(2))
#define SYSTEM_BT_RST_M  (BIT(2))
#define SYSTEM_BT_RST_V  0x1
#define SYSTEM_BT_RST_S  2
/* SYSTEM_MAC_RST : R/W ;bitpos:[1] ;default: 1'b0 ; */
/*description: */
#define SYSTEM_MAC_RST  (BIT(1))
#define SYSTEM_MAC_RST_M  (BIT(1))
#define SYSTEM_MAC_RST_V  0x1
#define SYSTEM_MAC_RST_S  1
/* SYSTEM_FE_RST : R/W ;bitpos:[0] ;default: 1'b0 ; */
/*description: */
#define SYSTEM_FE_RST  (BIT(0))
#define SYSTEM_FE_RST_M  (BIT(0))
#define SYSTEM_FE_RST_V  0x1
#define SYSTEM_FE_RST_S  0

#define SYSTEM_PERIP_CLK_CONF_REG          (DR_REG_CLKRST_BASE + 0x001C)
/* SYSTEM_MSPI_DIV_NUM : R/W ;bitpos:[31:24] ;default: 8'h1 ; */
/*description: */
#define SYSTEM_MSPI_DIV_NUM  0x000000FF
#define SYSTEM_MSPI_DIV_NUM_M  ((SYSTEM_MSPI_DIV_NUM_V)<<(SYSTEM_MSPI_DIV_NUM_S))
#define SYSTEM_MSPI_DIV_NUM_V  0xFF
#define SYSTEM_MSPI_DIV_NUM_S  24
/* SYSTEM_CAN_DIV_NUM : R/W ;bitpos:[23:16] ;default: 8'h1 ; */
/*description: */
#define SYSTEM_CAN_DIV_NUM  0x000000FF
#define SYSTEM_CAN_DIV_NUM_M  ((SYSTEM_CAN_DIV_NUM_V)<<(SYSTEM_CAN_DIV_NUM_S))
#define SYSTEM_CAN_DIV_NUM_V  0xFF
#define SYSTEM_CAN_DIV_NUM_S  16
/* SYSTEM_USB_DEVICE_DIV_NUM : R/W ;bitpos:[15:8] ;default: 8'h1 ; */
/*description: */
#define SYSTEM_USB_DEVICE_DIV_NUM  0x000000FF
#define SYSTEM_USB_DEVICE_DIV_NUM_M  ((SYSTEM_USB_DEVICE_DIV_NUM_V)<<(SYSTEM_USB_DEVICE_DIV_NUM_S))
#define SYSTEM_USB_DEVICE_DIV_NUM_V  0xFF
#define SYSTEM_USB_DEVICE_DIV_NUM_S  8
/* SYSTEM_SEC_DIV_NUM : R/W ;bitpos:[7:0] ;default: 8'h1 ; */
/*description: */
#define SYSTEM_SEC_DIV_NUM  0x000000FF
#define SYSTEM_SEC_DIV_NUM_M  ((SYSTEM_SEC_DIV_NUM_V)<<(SYSTEM_SEC_DIV_NUM_S))
#define SYSTEM_SEC_DIV_NUM_V  0xFF
#define SYSTEM_SEC_DIV_NUM_S  0

#define SYSTEM_PERIP_CLK_EN0_REG          (DR_REG_CLKRST_BASE + 0x0020)
/* SYSTEM_SPI4_CLK_EN : R/W ;bitpos:[31] ;default: 1'h1 ; */
/*description: */
#define SYSTEM_SPI4_CLK_EN  (BIT(31))
#define SYSTEM_SPI4_CLK_EN_M  (BIT(31))
#define SYSTEM_SPI4_CLK_EN_V  0x1
#define SYSTEM_SPI4_CLK_EN_S  31
/* SYSTEM_ADC2_ARB_CLK_EN : R/W ;bitpos:[30] ;default: 1'b1 ; */
/*description: */
#define SYSTEM_ADC2_ARB_CLK_EN  (BIT(30))
#define SYSTEM_ADC2_ARB_CLK_EN_M  (BIT(30))
#define SYSTEM_ADC2_ARB_CLK_EN_V  0x1
#define SYSTEM_ADC2_ARB_CLK_EN_S  30
/* SYSTEM_SYSTIMER_CLK_EN : R/W ;bitpos:[29] ;default: 1'b1 ; */
/*description: */
#define SYSTEM_SYSTIMER_CLK_EN  (BIT(29))
#define SYSTEM_SYSTIMER_CLK_EN_M  (BIT(29))
#define SYSTEM_SYSTIMER_CLK_EN_V  0x1
#define SYSTEM_SYSTIMER_CLK_EN_S  29
/* SYSTEM_APB_SARADC_CLK_EN : R/W ;bitpos:[28] ;default: 1'b1 ; */
/*description: */
#define SYSTEM_APB_SARADC_CLK_EN  (BIT(28))
#define SYSTEM_APB_SARADC_CLK_EN_M  (BIT(28))
#define SYSTEM_APB_SARADC_CLK_EN_V  0x1
#define SYSTEM_APB_SARADC_CLK_EN_S  28
/* SYSTEM_SPI3_DMA_CLK_EN : R/W ;bitpos:[27] ;default: 1'b1 ; */
/*description: */
#define SYSTEM_SPI3_DMA_CLK_EN  (BIT(27))
#define SYSTEM_SPI3_DMA_CLK_EN_M  (BIT(27))
#define SYSTEM_SPI3_DMA_CLK_EN_V  0x1
#define SYSTEM_SPI3_DMA_CLK_EN_S  27
/* SYSTEM_PWM3_CLK_EN : R/W ;bitpos:[26] ;default: 1'b0 ; */
/*description: */
#define SYSTEM_PWM3_CLK_EN  (BIT(26))
#define SYSTEM_PWM3_CLK_EN_M  (BIT(26))
#define SYSTEM_PWM3_CLK_EN_V  0x1
#define SYSTEM_PWM3_CLK_EN_S  26
/* SYSTEM_PWM2_CLK_EN : R/W ;bitpos:[25] ;default: 1'b0 ; */
/*description: */
#define SYSTEM_PWM2_CLK_EN  (BIT(25))
#define SYSTEM_PWM2_CLK_EN_M  (BIT(25))
#define SYSTEM_PWM2_CLK_EN_V  0x1
#define SYSTEM_PWM2_CLK_EN_S  25
/* SYSTEM_UART_MEM_CLK_EN : R/W ;bitpos:[24] ;default: 1'b1 ; */
/*description: */
#define SYSTEM_UART_MEM_CLK_EN  (BIT(24))
#define SYSTEM_UART_MEM_CLK_EN_M  (BIT(24))
#define SYSTEM_UART_MEM_CLK_EN_V  0x1
#define SYSTEM_UART_MEM_CLK_EN_S  24
/* SYSTEM_USB_DEVICE_CLK_EN : R/W ;bitpos:[23] ;default: 1'b1 ; */
/*description: */
#define SYSTEM_USB_DEVICE_CLK_EN  (BIT(23))
#define SYSTEM_USB_DEVICE_CLK_EN_M  (BIT(23))
#define SYSTEM_USB_DEVICE_CLK_EN_V  0x1
#define SYSTEM_USB_DEVICE_CLK_EN_S  23
/* SYSTEM_SPI2_DMA_CLK_EN : R/W ;bitpos:[22] ;default: 1'b1 ; */
/*description: */
#define SYSTEM_SPI2_DMA_CLK_EN  (BIT(22))
#define SYSTEM_SPI2_DMA_CLK_EN_M  (BIT(22))
#define SYSTEM_SPI2_DMA_CLK_EN_V  0x1
#define SYSTEM_SPI2_DMA_CLK_EN_S  22
/* SYSTEM_I2S1_CLK_EN : R/W ;bitpos:[21] ;default: 1'b0 ; */
/*description: */
#define SYSTEM_I2S1_CLK_EN  (BIT(21))
#define SYSTEM_I2S1_CLK_EN_M  (BIT(21))
#define SYSTEM_I2S1_CLK_EN_V  0x1
#define SYSTEM_I2S1_CLK_EN_S  21
/* SYSTEM_PWM1_CLK_EN : R/W ;bitpos:[20] ;default: 1'b0 ; */
/*description: */
#define SYSTEM_PWM1_CLK_EN  (BIT(20))
#define SYSTEM_PWM1_CLK_EN_M  (BIT(20))
#define SYSTEM_PWM1_CLK_EN_V  0x1
#define SYSTEM_PWM1_CLK_EN_S  20
/* SYSTEM_TWAI_CLK_EN : R/W ;bitpos:[19] ;default: 1'b0 ; */
/*description: */
#define SYSTEM_TWAI_CLK_EN  (BIT(19))
#define SYSTEM_TWAI_CLK_EN_M  (BIT(19))
#define SYSTEM_TWAI_CLK_EN_V  0x1
#define SYSTEM_TWAI_CLK_EN_S  19
/* SYSTEM_I2C_EXT1_CLK_EN : R/W ;bitpos:[18] ;default: 1'b0 ; */
/*description: */
#define SYSTEM_I2C_EXT1_CLK_EN  (BIT(18))
#define SYSTEM_I2C_EXT1_CLK_EN_M  (BIT(18))
#define SYSTEM_I2C_EXT1_CLK_EN_V  0x1
#define SYSTEM_I2C_EXT1_CLK_EN_S  18
/* SYSTEM_PWM0_CLK_EN : R/W ;bitpos:[17] ;default: 1'b0 ; */
/*description: */
#define SYSTEM_PWM0_CLK_EN  (BIT(17))
#define SYSTEM_PWM0_CLK_EN_M  (BIT(17))
#define SYSTEM_PWM0_CLK_EN_V  0x1
#define SYSTEM_PWM0_CLK_EN_S  17
/* SYSTEM_SPI3_CLK_EN : R/W ;bitpos:[16] ;default: 1'b1 ; */
/*description: */
#define SYSTEM_SPI3_CLK_EN  (BIT(16))
#define SYSTEM_SPI3_CLK_EN_M  (BIT(16))
#define SYSTEM_SPI3_CLK_EN_V  0x1
#define SYSTEM_SPI3_CLK_EN_S  16
/* SYSTEM_TIMERGROUP1_CLK_EN : R/W ;bitpos:[15] ;default: 1'b1 ; */
/*description: */
#define SYSTEM_TIMERGROUP1_CLK_EN  (BIT(15))
#define SYSTEM_TIMERGROUP1_CLK_EN_M  (BIT(15))
#define SYSTEM_TIMERGROUP1_CLK_EN_V  0x1
#define SYSTEM_TIMERGROUP1_CLK_EN_S  15
/* SYSTEM_EFUSE_CLK_EN : R/W ;bitpos:[14] ;default: 1'b1 ; */
/*description: */
#define SYSTEM_EFUSE_CLK_EN  (BIT(14))
#define SYSTEM_EFUSE_CLK_EN_M  (BIT(14))
#define SYSTEM_EFUSE_CLK_EN_V  0x1
#define SYSTEM_EFUSE_CLK_EN_S  14
/* SYSTEM_TIMERGROUP_CLK_EN : R/W ;bitpos:[13] ;default: 1'b1 ; */
/*description: */
#define SYSTEM_TIMERGROUP_CLK_EN  (BIT(13))
#define SYSTEM_TIMERGROUP_CLK_EN_M  (BIT(13))
#define SYSTEM_TIMERGROUP_CLK_EN_V  0x1
#define SYSTEM_TIMERGROUP_CLK_EN_S  13
/* SYSTEM_UHCI1_CLK_EN : R/W ;bitpos:[12] ;default: 1'b0 ; */
/*description: */
#define SYSTEM_UHCI1_CLK_EN  (BIT(12))
#define SYSTEM_UHCI1_CLK_EN_M  (BIT(12))
#define SYSTEM_UHCI1_CLK_EN_V  0x1
#define SYSTEM_UHCI1_CLK_EN_S  12
/* SYSTEM_LEDC_CLK_EN : R/W ;bitpos:[11] ;default: 1'b0 ; */
/*description: */
#define SYSTEM_LEDC_CLK_EN  (BIT(11))
#define SYSTEM_LEDC_CLK_EN_M  (BIT(11))
#define SYSTEM_LEDC_CLK_EN_V  0x1
#define SYSTEM_LEDC_CLK_EN_S  11
/* SYSTEM_PCNT_CLK_EN : R/W ;bitpos:[10] ;default: 1'b0 ; */
/*description: */
#define SYSTEM_PCNT_CLK_EN  (BIT(10))
#define SYSTEM_PCNT_CLK_EN_M  (BIT(10))
#define SYSTEM_PCNT_CLK_EN_V  0x1
#define SYSTEM_PCNT_CLK_EN_S  10
/* SYSTEM_RMT_CLK_EN : R/W ;bitpos:[9] ;default: 1'b0 ; */
/*description: */
#define SYSTEM_RMT_CLK_EN  (BIT(9))
#define SYSTEM_RMT_CLK_EN_M  (BIT(9))
#define SYSTEM_RMT_CLK_EN_V  0x1
#define SYSTEM_RMT_CLK_EN_S  9
/* SYSTEM_UHCI0_CLK_EN : R/W ;bitpos:[8] ;default: 1'b0 ; */
/*description: */
#define SYSTEM_UHCI0_CLK_EN  (BIT(8))
#define SYSTEM_UHCI0_CLK_EN_M  (BIT(8))
#define SYSTEM_UHCI0_CLK_EN_V  0x1
#define SYSTEM_UHCI0_CLK_EN_S  8
/* SYSTEM_I2C_EXT0_CLK_EN : R/W ;bitpos:[7] ;default: 1'b0 ; */
/*description: */
#define SYSTEM_I2C_EXT0_CLK_EN  (BIT(7))
#define SYSTEM_I2C_EXT0_CLK_EN_M  (BIT(7))
#define SYSTEM_I2C_EXT0_CLK_EN_V  0x1
#define SYSTEM_I2C_EXT0_CLK_EN_S  7
/* SYSTEM_SPI2_CLK_EN : R/W ;bitpos:[6] ;default: 1'b1 ; */
/*description: */
#define SYSTEM_SPI2_CLK_EN  (BIT(6))
#define SYSTEM_SPI2_CLK_EN_M  (BIT(6))
#define SYSTEM_SPI2_CLK_EN_V  0x1
#define SYSTEM_SPI2_CLK_EN_S  6
/* SYSTEM_UART1_CLK_EN : R/W ;bitpos:[5] ;default: 1'b1 ; */
/*description: */
#define SYSTEM_UART1_CLK_EN  (BIT(5))
#define SYSTEM_UART1_CLK_EN_M  (BIT(5))
#define SYSTEM_UART1_CLK_EN_V  0x1
#define SYSTEM_UART1_CLK_EN_S  5
/* SYSTEM_I2S0_CLK_EN : R/W ;bitpos:[4] ;default: 1'b0 ; */
/*description: */
#define SYSTEM_I2S0_CLK_EN  (BIT(4))
#define SYSTEM_I2S0_CLK_EN_M  (BIT(4))
#define SYSTEM_I2S0_CLK_EN_V  0x1
#define SYSTEM_I2S0_CLK_EN_S  4
/* SYSTEM_WDG_CLK_EN : R/W ;bitpos:[3] ;default: 1'b1 ; */
/*description: */
#define SYSTEM_WDG_CLK_EN  (BIT(3))
#define SYSTEM_WDG_CLK_EN_M  (BIT(3))
#define SYSTEM_WDG_CLK_EN_V  0x1
#define SYSTEM_WDG_CLK_EN_S  3
/* SYSTEM_UART_CLK_EN : R/W ;bitpos:[2] ;default: 1'b1 ; */
/*description: */
#define SYSTEM_UART_CLK_EN  (BIT(2))
#define SYSTEM_UART_CLK_EN_M  (BIT(2))
#define SYSTEM_UART_CLK_EN_V  0x1
#define SYSTEM_UART_CLK_EN_S  2
/* SYSTEM_SPI01_CLK_EN : R/W ;bitpos:[1] ;default: 1'b1 ; */
/*description: */
#define SYSTEM_SPI01_CLK_EN  (BIT(1))
#define SYSTEM_SPI01_CLK_EN_M  (BIT(1))
#define SYSTEM_SPI01_CLK_EN_V  0x1
#define SYSTEM_SPI01_CLK_EN_S  1
/* SYSTEM_TIMERS_CLK_EN : R/W ;bitpos:[0] ;default: 1'b1 ; */
/*description: */
#define SYSTEM_TIMERS_CLK_EN  (BIT(0))
#define SYSTEM_TIMERS_CLK_EN_M  (BIT(0))
#define SYSTEM_TIMERS_CLK_EN_V  0x1
#define SYSTEM_TIMERS_CLK_EN_S  0

